package source;

public class NumberList {
    private static final String[][] numbers = {
            {"десять","одинадцать","двенадцать","тринадцать","четырнадцать","пятьнадцать","шестьнадцать","семьнадцать","восемьнадцать","девятьнадцать"},
            {"ноль","один","два","три","четыре","пять","шесть","семь","восемь","девять"},
            {"ноль","десять","двадцать","тридцать","сорок","пятьдесят","шестьдесят","семьдесят","восемьдесят","девяносто"},
            {"ноль","сто","двести","триста","четыреста","пятьсот","шестьсот","семьсот","восемьсот","девятьсот"},
            {"ноль","одна тысяча","две тысячи","три тысячи","четыре тысячи","пять тысяч","шесть тысяч","семь тысяч","восемь тысяч","девять тысяч"}};

    public static String giveStringDec (int dec, int num){
        return numbers[dec][num];
    }

}
